// app/components/CityIndex.js
const citiesByLetter = {
    А: ['Абакан', 'Адлер', 'Алушта', 'Альметьевск', 'Анапа', 'Ангарск', 'Апатиты', 'Арзамас', 'Армавир', 'Архангельск', 'Астрахань', 'Ахтубинск', 'Ачинск'],
    Б: ['Бавлы', 'Балаково', 'Балашиха', 'Балашов', 'Барнаул', 'Белгород', 'Белово', 'Белокуриха', 'Белорецк', 'Белореченск', 'Белоярский', 'Бердск'],
    Ж: ['Железнодорожный', 'Жуковский'],
    З: ['Звенигород', 'Зеленогорск', 'Зеленоград', 'Зеленоградск', 'Зеленодольск', 'Златоуст'],
    И: ['Иваново', 'Ивантеевка', 'Ижевск', 'Икша', 'Иркутск', 'Искитим', 'Истра', 'Ишим'],
    Й: ['Йошкар-Ола'],
    К: ['Кабардинка', 'Казань', 'Калач-на-Дону', 'Калининград', 'Калуга', 'Каменск-Уральский', 'Камышин', 'Канск'],
    М: ['Минеральные Воды', 'Минусинск', 'Мирный', 'Мончегорск', 'Москва', 'Московский', 'Муравленко', 'Мурино', 'Мурманск', 'Муром', 'Мыски', 'Мытищи'],
    Н: ['Набережные Челны', 'Надым', 'Назарово', 'Нальчик', 'Наро-Фоминск', 'Невинномысск', 'Нерюнгри', 'Нефтекамск', 'Нефтеюганск', 'Нижневартовск', 'Нижнекамск', 'Нижний Новгород', 'Нижний Тагил', 'Новоталкай'],
    С: ['Саянск', 'Светлогорск', 'Севастополь', 'Северодвинск', 'Североморск', 'Сергиев Посад', 'Серов', 'Серпухов', 'Сестрорецк', 'Симферополь', 'Смоленск', 'Советск', 'Советская гавань', 'Советский', 'Соликамск', 'Солнечногорск', 'Соль-Илецк', 'Сосновоборск', 'Сочи', 'Ставрополь', 'Старый Оскол', 'Стерлитамак', 'Стрежевой', 'Ступино', 'Судак', 'Суздаль'],
  };
  
  export default function CityIndex() {
    return (
      <div className=" mx-auto p-6 ">
        <h1 className="text-2xl lg:text-3xl  text-primary-dark font-bold text-left mb-10">Россия</h1>
        <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 xl:grid-cols-4 gap-6">
          {Object.entries(citiesByLetter).map(([letter, cities]) => (
            <div key={letter}>
              <h2 className="text-primary-dark font-bold mb-2 text-2xl">{letter}</h2>
              <ul className="space-y-1">
                {cities.map((city) => (
                  <li key={city} className="text-primary-dark hover:text-primary-hover hover:underline transition-all cursor-pointer">{city}</li>
                ))}
              </ul>
            </div>
          ))}
        </div>
      </div>
    );
  }
  