
const page = () => {
  return (
    <div className='max-w-7xl mx-auto  px-4 py-8'>
      <h1 className='mt-12 text-center text-primary-dark'>Пользовательское соглашение</h1>
      <h5 className=' text-center text-primary-dark'> регламентирующий отношения между сайтом и пользователями. </h5>
    <br/> 
    <br/> 
    <br/> 
    <br/> 
    <h4  className='text-lg  text-primary-dark' >Индивидуальный предприниматель Шевелёва Татьяна Николаевна
      <br/>ОГРНИП: 324723200031395, ИНН: 860235365698, 
      <br/>адрес регистрации: 628004, Тюменская обл., г. Тюмень, ул. Кольцевая, д.392
      <br/>далее — «Оператор» публикует настоящую Политику обработки персональных данных
      <br/>далее — «Политика» на сайте https://www.kvkey.ru 
      <br/>далее — «Сайт  в соответствии с Федеральным законом от 27.07.2006 № 152-ФЗ «О персональных данных» 
      <br/>далее — «Закон».
    </h4>
    <p className='text-sm text-primary-dark'>
      <br/>1. Общие положения
      <br/>1.1. Политика разработана в соответствии с Федеральным законом от 27.07.2006 № 152-ФЗ «О персональных данных»
      <br/>1.2. Цели Политики: защита прав и свобод субъектов персональных данных (далее — «Субъекты») и обеспечение безопасности их данных.
      <br/>1.3. Политика действует для всех операций с ПДн, совершаемых при использовании Сайта и сервисов kvkey.ru.
      <br/>1.4. Использование Сайта означает безоговорочное согласие Субъекта с условиями Политики.
      <br/>2. Термины и определения
      <br/>- Персональные данные — любая информация, относящаяся к определённому или определяемому физическому лицу.
      <br/>Обработка ПДн — любое действие с данными: сбор, запись, систематизация, хранение, уточнение, использование, передача, обезличивание, блокирование, <br/>уничтожение.
      <br/>- Оператор — лицо, осуществляющее обработку ПДн и определяющее цели и способы обработки (ИП Шевелёва).
      <br/>- Субъект — физическое или юридическое лицо, чьи ПДн обрабатываются.
      <br/>- Автоматизированная обработка — обработка с использованием вычислительной техники.
      <br/>- Уполномоченное лицо — лицо, ответственное за организацию обработки и защиту ПДн.
      <br/>3. Уполномоченное лицо за защиту ПДн
      <br/>3.1. Ответственное лицо:
      <br/>- Шевелёва Татьяна Николаевна
      <br/>- Почтовый адрес: 628004, Тюменская обл., г. Тюмень, ул. Кольцевая 392
      <br/>- Телефон: +7 888 888-88-88
      <br/>- Email: info@_________________-
      <br/>4. Принципы и правовые основания обработки
      <br/>4.1. Принципы: законность, справедливость, ограничение целей, минимизация данных, достоверность, хранение не дольше необходимого, конфиденциальность.
      <br/>4.2. Основания (ст. 24–27 ФЗ-152):
      <br/>- Согласие Субъекта на обработку (получается при регистрации или при предоставлении форм).
      <br/>- Договор между Оператором и Субъектом.
      <br/>- Требования законодательства.
      <br/>5. Согласие Субъекта
      <br/>5.1. Форма: письменное или электронное (через формы сайта, проставление флажка «Я принимаю Политику»).
      <br/>5.2. Отзыв: Субъект может отозвать согласие, направив заявление на email info@______________ или письменно на почтовый адрес Оператора.
      <br/>5.3. Последствия отзыва: прекращение обработки на основании согласия, за исключением обработки, необходимой для исполнения обязательств перед Субъектом <br/>или по закону.
      <br/>6. Категории и цели обработки
      <br/>6.1. Категории ПДн:
      <br/>- ФИО, email, телефон;
      <br/>- Логин, хэш-пароль;
      <br/>- IP, данные устройств, cookie;
      <br/>- История действий на Сайте;
      <br/>- Платёжные данные.
      <br/>6.2. Цели:
      <br/>- Регистрация, идентификация;
      <br/>- Оказание услуг продвижения;
      <br/>- Информирование, рассылки при наличии согласия;
      <br/>- Исполнение договоров;
      <br/>- Соблюдение требований закона;
      <br/>- Обеспечение безопасности и улучшение Сайта.
      <br/>7. Трансграничная передача ПДн
      <br/>7.1. Трансграничная передача ПДн не осуществляется.
      <br/>8. Уничтожение и обезличивание
      <br/>8.1. По окончании хранения ПДн (не более 5 лет) выполняется обезличивание: удаление идентификаторов, замена ФИО случайным набором символов.
      <br/>8.2. После указанного срока в течение 30 дней осуществляется физическое или цифровое уничтожение носителей.
      <br/>9. Конфиденциальность и безопасность
      <br/>9.1. Оператор и иные лица, получившие доступ к персональным данным, обязаны не раскрывать третьим лицам и не распространять персональные данные без <br/>согласия субъекта персональных данных, если иное не предусмотрено федеральным законом.
      <br/>9.2. Безопасность персональных данных, обрабатываемых Оператора, обеспечивается реализацией правовых, организационных и технических мер, необходимых для <br/>обеспечения требований федерального законодательства в области защиты персональных данных.
      <br/>10. Права Субъектов
      <br/>10.1. Субъект имеет право:
      <br/>- Получать подтверждение факта обработки своих персональных данных.
      <br/>- Запрашивать доступ к своим данным и копии обрабатываемых сведений.
      <br/>- Требовать уточнения, блокирования или уничтожения неполных, устаревших, неточных, незаконно полученных или неактуальных данных.
      <br/>- Отозвать своё согласие на обработку персональных данных в любой момент (если это не противоречит другим основаниям обработки, перечисленным в политике).
      <br/>- Обжаловать действия или бездействие Оператора в Роскомнадзор или суде.
      <br/>- Пользоваться другими правами, установленными законодательством.
      <br/>10.2. Порядок реализации прав:
      <br/>- Запрос оформления права направляется в письменном виде по почтовому адресу Оператора или в электронной форме на info@______________.
      <br/>- Оператор обязан рассмотреть запрос и предоставить ответ в течение 30 календарных дней.
      <br/>- В исключительных случаях (сложность запроса) срок может быть продлен еще на 30 дней при уведомлении Субъекта.
      <br/>- Первый запрос обрабатывается бесплатно. За повторные запросы в течение года может взиматься плата, не превышающая фактических расходов Оператора.
      <br/>11. Сроки хранения персональных данных
      <br/>11.1. Сроки хранения по категориям:
      <br/>- Согласия и договоры: в течение всего срока действия документа и 3 года после окончания.
      <br/>- Учетные данные (логин, пароль): не дольше 1 года после последней активности.
      <br/>- Платежные и финансовые данные: 5 лет по требованиям бухгалтерского учёта.
      <br/>- Технические логи (IP, cookie): не дольше 6 месяцев.
      <br/>- Другая информация: в течение срока, необходимого для целей обработки.
      <br/>11.2. По истечении сроков:
      <br/>1. Обезличивание в порядке раздела 8
      <br/>2. Хранение обезличенных данных для статистики и аналитики.
      <br/>3. Уничтожение носителей в течение 30 дней после обезличивания.
      <br/>12. Заключительные положения
      <br/>12.1. Политика вступает в силу с момента публикации на сайте и действует до её замены новым документом.
      <br/>12.2. Изменения в Политику вносятся приказом Оператора и публикуются на странице https://www.kvkey.ru/politics не позднее, чем за 10 рабочих дней до <br/>вступления в силу.
      <br/>12.3. Актуальная версия Политики всегда доступна по указанному адресу.
      <br/>12.4. Дата последнего обновления: 26.06.2025
    </p>

    </div>
  )
}

export default page;